Repository: 84000/data-translation-memory
Catalog: toh154-v2.tmx
Source language: bo
Languages: en

source: ཀླུའི་བདག་པོ་དེ་བཞིན་དུ་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྣམས་ཀྱང་ལྷ་དང་། མིར་སྐྱེ་བའི་རྟེན་ཏོ། །
en: In the same way, lord of nāgas, the paths of the ten virtues are the basis for taking birth in the realms of gods and humans.

source: སློབ་པ་དང་། མི་སློབ་པའི་འབྲས་བུ་རྙེད་པ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཀྱི་རྟེན་ཡིན་པ་ནས།
en: They are the basis for everything from the path of learning to achieving the fruition of no-more-learning, and the awakening of the hearers and the solitary buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་བར་གྱི་རྟེན་ཡིན་ནོ། །
en: They are also the basis for everything from all buddha and bodhisattva deeds all the way up to all buddha qualities.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: When the Blessed One had spoken these words,

source: ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོ་དང་། དགེ་སློང་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།
en: the nāga king Sāgara, the monks, the bodhisattvas, the whole assembly, and the world with its gods, humans, asuras, and gandharvas rejoiced and praised the Blessed One’s words.

source: འཕགས་པ་ཀླུའི་རྒྱལ་པོ་རྒྱ་མཚོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།། །།
en: This concludes the noble Great Vehicle sūtra “The Questions of the Nāga King Sāgara.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། མུ་ནེ་བར་མ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བནྡེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: Translated, edited, and finalized, having been revised according to the new terminological register, by the Indian scholars Jinamitra, Dānaśīla, and Munivarman, and the chief editor-translator Bandé Yeshé Dé and others.
